[Killed] BlockStatement
src/app/pipes/temperature.pipe.ts:8:87
   standalone: true,
 })
 export class TemperaturePipe implements PipeTransform {
-  transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = 'Celsius'): string {
-    if (scale === 'Fahrenheit') {
-      return `${temperature} °F`;
-    } else {
-      return `${temperature} °C`;
-    }
-  }
+  transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = 'Celsius'): string {}
 }
 
killedBy: TemperaturePipe transform should display temperature in °C when no scale is provided
statusReason: Expected undefined to be '24 °C'.

[Survived] StringLiteral
src/app/pipes/temperature.pipe.ts:8:68
   standalone: true,
 })
 export class TemperaturePipe implements PipeTransform {
-  transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = 'Celsius'): string {
+  transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = ""): string {
     if (scale === 'Fahrenheit') {
       return `${temperature} °F`;

[Killed] EqualityOperator
src/app/pipes/temperature.pipe.ts:9:9
 })
 export class TemperaturePipe implements PipeTransform {
   transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = 'Celsius'): string {
-    if (scale === 'Fahrenheit') {
+    if (scale !== 'Fahrenheit') {
       return `${temperature} °F`;
     } else {
killedBy: TemperaturePipe transform should display temperature in °C when no scale is provided
statusReason: Expected '24 °F' to be '24 °C'.

[Killed] ConditionalExpression
src/app/pipes/temperature.pipe.ts:9:9
 })
 export class TemperaturePipe implements PipeTransform {
   transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = 'Celsius'): string {
-    if (scale === 'Fahrenheit') {
+    if (false) {
       return `${temperature} °F`;
     } else {
killedBy: TemperaturePipe transform should display temperature in °F when Fahrenheit scale is provided
statusReason: Expected '24 °C' to be '24 °F'.

[Killed] BlockStatement
src/app/pipes/temperature.pipe.ts:11:12
   transform(temperature: number, scale: 'Celsius' | 'Fahrenheit' = 'Celsius'): string {
     if (scale === 'Fahrenheit') {
       return `${temperature} °F`;
-    } else {
-      return `${temperature} °C`;
-    }
+    } else {}
   }
 }
killedBy: TemperaturePipe transform should display temperature in °C when no scale is provided
statusReason: Expected undefined to be '24 °C'.

[Killed] StringLiteral
src/app/pipes/temperature.pipe.ts:12:14
     if (scale === 'Fahrenheit') {
       return `${temperature} °F`;
     } else {
-      return `${temperature} °C`;
+      return ``;
     }
   }
killedBy: TemperaturePipe transform should display temperature in °C when no scale is provided
statusReason: Expected '' to be '24 °C'.
